[NoCoverage] BlockStatement
src/Roller.ts:7:22
     private _faces: number;
     private _phrase: string;
 
-    length(): number {
-        return this._phrase.length;
-    }
+    length(): number {}
 
     // specifies the number of faces the die has. It must have at least 2 faces

[Killed] BlockStatement
src/Roller.ts:14:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-
-        this._faces = faces >= 2 ? faces : 6;
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
-        this._last = 0;
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller constructor should create a 6-sided die if no faces are specified
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] EqualityOperator
src/Roller.ts:16:23
     // six-sided die.
     constructor(faces: number) {
 
-        this._faces = faces >= 2 ? faces : 6;
+        this._faces = faces < 2 ? faces : 6;
         this._distribution = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
killedBy: Roller constructor should create a 6-sided die if no faces are specified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/Roller.ts:16:23
     // six-sided die.
     constructor(faces: number) {
 
-        this._faces = faces >= 2 ? faces : 6;
+        this._faces = true ? faces : 6;
         this._distribution = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
killedBy: Roller constructor should create a 6-sided die if no faces are specified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/Roller.ts:34:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if (value < 1 || value > this._faces) {
-            return 0;
-        }
-        this._last = value;
-        let rollCount = this._distribution.get(value) as number;
-        this._distribution.set(value, rollCount + 1);
-        return value;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller constructor should create a 6-sided die if no faces are specified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
src/Roller.ts:40:39
         }
         this._last = value;
         let rollCount = this._distribution.get(value) as number;
-        this._distribution.set(value, rollCount + 1);
+        this._distribution.set(value, rollCount - 1);
         return value;
     }
killedBy: Roller constructor should create a 6-sided die if no faces are specified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/Roller.ts:55:40
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number>{
-        let result = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            let count = this._distribution.get(i) as number;
-            result.set(i, count);
-        }
-        return result;
-    }
+    distribution(): Map<number, number>{}
 } // end of Roller class
killedBy: Roller constructor should create a 6-sided die if no faces are specified
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] EqualityOperator
src/Roller.ts:57:25
     // value of 0.
     distribution(): Map<number, number>{
         let result = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i < this._faces; i++) {
             let count = this._distribution.get(i) as number;
             result.set(i, count);
killedBy: Roller roll should record the roll and update the distribution for valid values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:57:25
     // value of 0.
     distribution(): Map<number, number>{
         let result = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i > this._faces; i++) {
             let count = this._distribution.get(i) as number;
             result.set(i, count);
killedBy: Roller constructor should create a 6-sided die if no faces are specified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
